Configuration/src/Documents/Services/Services.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Services</name>
  <registerRecords>AccumulationRegister.BalanceOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.Sales</registerRecords>
  <registerRecords>AccumulationRegister.CostOfMaterials</registerRecords>
  <registerRecords>AccountingRegister.Primary</registerRecords>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Customers</types>
    </type>
  </attributes>
  <attributes>
    <name>Technician</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <tabularSections>
    <name>MaterialsAndServices</name>
    <attributes>
      <name>MaterialOrService</name>
      <type>
        <types>CatalogRef.MaterialsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PropertySet</name>
      <type>
        <types>CatalogRef.MaterialOptions</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/src/Documents/Services/Forms/DocumentForm/Module.bsl
&AtClient
Procedure MaterialsAndServicesQuantityOnChange(Item)
	TabularSectionRow = Items.MaterialsAndServices.CurrentData;
	DocumentProcessing.CalculateTotal(TabularSectionRow);
EndProcedure

&AtClient
Procedure MaterialsAndServicesPriceOnChange(Item)
	TabularSectionRow = Items.MaterialsAndServices.CurrentData;
	DocumentProcessing.CalculateTotal(TabularSectionRow);
EndProcedure

&AtClient
Procedure MaterialsAndServicesMaterialOrServiceOnChange(Item)
	// Getting current tabular section row
	TabularSectionRow = Items.MaterialsAndServices.CurrentData;
	// Setting price
	TabularSectionRow.Price = CatalogProcessing.RetailPrice(Object.Date,
	TabularSectionRow.MaterialOrService);
	//Recalculating row total
	DocumentProcessing.CalculateTotal(TabularSectionRow);
EndProcedure
